In [5]:
from test_database_function import *

In [31]:
columns = """
    id INT AUTO_INCREMENT PRIMARY KEY,
    測試欄位 VARCHAR(255) NOT NULL UNIQUE
"""

In [7]:
conn = get_connection()

Successfully connected!

In [32]:
create_table(conn, "Astronomy", "test", columns)

Table test created successfully in Astronomy.

In [33]:
df = pd.read_csv(r'C:\Users\T14 Gen 3\Desktop\tir102_02 - test\test.csv')
df

        測試欄位
0  這是第一段中文字串
1  這是第二段中文字串
2  這是第三段中文字串

In [34]:
engine = create_engine('mysql+pymysql://root:password@localhost:3306/Astronomy')

In [35]:
insertdata(df, "test", engine)

Data added successfully

In [36]:
conn.close()
print("The connection is closed")

The connection is closed